turbines_nrelok/0.org/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (11.4 0 0);
pressure             0;
turbulentK          0.078; // Was 2e-4
turbulentOmega     0.082123; // Was 0.01; Guess ~ 0.09*k**(3/2)/l

// ************************************************************************* //
