turbines_nrelok/0.org/include/logLawField
// Logarithmic profile condition

internalField	#codeStream
{
	codeInclude
	#{
		#include "fvCFD.H"
	#};

	codeOptions
	#{
		-I$(LIB_SRC)/finiteVolume/lnInclude \
		-I$(LIB_SRC)/meshTools/lnInclude
	#};

	codeLibs
	#{
		-lmeshTools \
		-lfiniteVolume
	#};

	code
	#{
		const IOdictionary& d = static_cast<const IOdictionary&>(dict);
		const fvMesh& mesh = refCast<const fvMesh>(d.db());
		vectorField U(mesh.nCells(), vector(0., 0., 0.));
		const scalar U_ref = 11.4; //Hub height vel
		const scalar z_ref = 90.0; //Hub height
		const scalar z_0 = 0.00609; // Surface roughness length	
		const scalar z_ground = 0.0; //Ground height
		scalar U_h = 0.0; //Height-varying velocity
		// scalar U_h = 0.0; //Height-varying velocity

		forAll(U, i)
		{
			const scalar z = mesh.C()[i][2];
			if (z-z_ground>z_0) // Above ground height
			{	
				U_h = U_ref * log((z-z_ground)/z_0)/log((z_ref-z_ground)/z_0); //Log profile
				U[i] = vector(U_h, 0., 0.);	
			} 
			else U[i] = vector(0., 0., 0.);	 
		};

		U.writeEntry("",os);

	#};

};
