turbines_nrelok/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform  $turbulentK;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    ground
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }
    top
    {
        type            fixedValue;
        value           $internalField;
    }
    sides
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }    
}


// ************************************************************************* //
