turbines_nrelok/system/blockMeshDict_1.5mesh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale     1;

xmin    -340;
xmax     812;
ymin    -252;
ymax     252;
zmin     -50;
zmax     262;

xcell    96;
ycell     42;
zcell     26;

vertices        
(
    ( $xmin $ymin $zmin ) //0
    ( $xmax $ymin $zmin ) //1
    ( $xmax $ymax $zmin ) //2
    ( $xmin $ymax $zmin ) //3
    ( $xmin $ymin $zmax ) //4
    ( $xmax $ymin $zmax ) //5
    ( $xmax $ymax $zmax ) //6
    ( $xmin $ymax $zmax ) //7                 
);

blocks
(   
    hex (0 1 2 3 4 5 6 7) ( $xcell $ycell $zcell )simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
       type patch;
       faces
        (
            (1 2 6 5)
        );
    }

    top
    {
       type patch;
       faces
        (
            (4 5 6 7) 
        );
    }

    ground
    {
       type wall;
       faces
        (
            (0 3 2 1) 
        );
    }

    sides
    {
       type wall;
       faces
        (
            (0 1 5 4) 
            (2 3 7 6) 
        );
    }

);


mergePatchPairs
(
);

// ************************************************************************* //
