turbines_nrelok/system/elementData
// Blade element data
// Divides the blade into N stations. Two stations define a span section (N-1 span sections).
// An integer number of actuator elements will be defined along each span section. 
// 19 nodes (18 elements) for the NREL 15-MW RWT
// axialDistance[m], radius[m], azimuth, chord[m], chordMount[%], twist[deg]
(0.000  0.0000000E+00   0.000    3.5420000E+00   0.250      0.000)  //0
(0.000  1.3667000E+00   0.000    3.5420000E+00   0.249      0.000)  //1
(0.000  4.1000000E+00   0.000    3.8540000E+00   0.221      0.000)  //2
(0.000  6.8333000E+00   0.000    4.1670000E+00   0.188      0.000)  //3
(0.000  1.0250000E+01   0.000    4.5570000E+00   0.146      0.000)  //4
(0.000  1.4350000E+01   0.000    4.6520000E+00   0.125      0.000)  //5
(0.000  1.8450000E+01   0.000    4.4580000E+00   0.125      0.000)  //6
(0.000  2.2550000E+01   0.000    4.2490000E+00   0.125      0.000)  //7
(0.000  2.6650000E+01   0.000    4.0070000E+00   0.125      0.000)  //8
(0.000  3.0750000E+01   0.000    3.7480000E+00   0.125      0.000)  //9
(0.000  3.4850000E+01   0.000    3.5020000E+00   0.125      0.000)  //10
(0.000  3.8950000E+01   0.000    3.2560000E+00   0.125      0.000)  //11
(0.000  4.3050000E+01   0.000    3.0100000E+00   0.125      0.000)  //12
(0.000  4.7150000E+01   0.000    2.7640000E+00   0.125      0.000)  //13
(0.000  5.1250000E+01   0.000    2.5180000E+00   0.125      0.000)  //14
(0.000  5.4666700E+01   0.000    2.3130000E+00   0.125      0.000)  //15
(0.000  5.7400000E+01   0.000    2.0860000E+00   0.125      0.000)  //16
(0.000  6.0133300E+01   0.000    1.4190000E+00   0.125      0.000)  //17
(0.000  6.1500000E+01   0.000    1.4190000E+00   0.125      0.000)  //18
/*
(0.000  1.50000   0.000    3.5420000E+00   0.250      0.000)  //0
(0.000  2.86670   0.000    3.5420000E+00   0.249      0.000)  //1
(0.000  5.60000   0.000    3.8540000E+00   0.221      0.000)  //2
(0.000  8.33330   0.000    4.1670000E+00   0.188      0.000)  //3
(0.000  11.7500   0.000    4.5570000E+00   0.146      0.000)  //4
(0.000  15.8500   0.000    4.6520000E+00   0.125      0.000)  //5
(0.000  19.9500   0.000    4.4580000E+00   0.125      0.000)  //6
(0.000  24.0500   0.000    4.2490000E+00   0.125      0.000)  //7
(0.000  28.1500   0.000    4.0070000E+00   0.125      0.000)  //8
(0.000  32.2500   0.000    3.7480000E+00   0.125      0.000)  //9
(0.000  36.3500   0.000    3.5020000E+00   0.125      0.000)  //10
(0.000  40.4500   0.000    3.2560000E+00   0.125      0.000)  //11
(0.000  44.5500   0.000    3.0100000E+00   0.125      0.000)  //12
(0.000  48.6500   0.000    2.7640000E+00   0.125      0.000)  //13
(0.000  52.7500   0.000    2.5180000E+00   0.125      0.000)  //14
(0.000  56.1667   0.000    2.3130000E+00   0.125      0.000)  //15
(0.000  58.9000   0.000    2.0860000E+00   0.125      0.000)  //16
(0.000  61.6333   0.000    1.4190000E+00   0.125      0.000)  //17
(0.000  63.0000   0.000    1.4190000E+00   0.125      0.000)  //18
/*
(0.000  0.0000000E+00   0.000    3.5420000E+00   0.250      0.000)  //0
(0.000  1.3667000E+00   0.000    3.5420000E+00   0.249      0.000)  //1
(0.000  4.1000000E+00   0.000    3.8540000E+00   0.221      0.000)  //2
(0.000  6.8333000E+00   0.000    4.1670000E+00   0.188      0.000)  //3
(0.000  1.0250000E+01   0.000    4.5570000E+00   0.146      0.000)  //4
(0.000  1.4350000E+01   0.000    4.6520000E+00   0.125      0.000)  //5
(0.000  1.8450000E+01   0.000    4.4580000E+00   0.125      0.000)  //6
(0.000  2.2550000E+01   0.000    4.2490000E+00   0.125      0.000)  //7
(0.000  2.6650000E+01   0.000    4.0070000E+00   0.125      0.000)  //8
(0.000  3.0750000E+01   0.000    3.7480000E+00   0.125      0.000)  //9
(0.000  3.4850000E+01   0.000    3.5020000E+00   0.125      0.000)  //10
(0.000  3.8950000E+01   0.000    3.2560000E+00   0.125      0.000)  //11
(0.000  4.3050000E+01   0.000    3.0100000E+00   0.125      0.000)  //12
(0.000  4.7150000E+01   0.000    2.7640000E+00   0.125      0.000)  //13
(0.000  5.1250000E+01   0.000    2.5180000E+00   0.125      0.000)  //14
(0.000  5.4666700E+01   0.000    2.3130000E+00   0.125      0.000)  //15
(0.000  5.7400000E+01   0.000    2.0860000E+00   0.125      0.000)  //16
(0.000  6.0133300E+01   0.000    1.4190000E+00   0.125      0.000)  //17
(0.000  6.1500000E+01   0.000    1.4190000E+00   0.125      0.000)  //18

(0.000  1.50000   0.000    3.5420000E+00   0.250      0.000)  //0
(0.000  2.86670   0.000    3.5420000E+00   0.249      0.000)  //1
(0.000  5.60000   0.000    3.8540000E+00   0.221      0.000)  //2
(0.000  8.33330   0.000    4.1670000E+00   0.188      0.000)  //3
(0.000  11.7500   0.000    4.5570000E+00   0.146      0.000)  //4
(0.000  15.8500   0.000    4.6520000E+00   0.125      0.000)  //5
(0.000  19.9500   0.000    4.4580000E+00   0.125      0.000)  //6
(0.000  24.0500   0.000    4.2490000E+00   0.125      0.000)  //7
(0.000  28.1500   0.000    4.0070000E+00   0.125      0.000)  //8
(0.000  32.2500   0.000    3.7480000E+00   0.125      0.000)  //9
(0.000  36.3500   0.000    3.5020000E+00   0.125      0.000)  //10
(0.000  40.4500   0.000    3.2560000E+00   0.125      0.000)  //11
(0.000  44.5500   0.000    3.0100000E+00   0.125      0.000)  //12
(0.000  48.6500   0.000    2.7640000E+00   0.125      0.000)  //13
(0.000  52.7500   0.000    2.5180000E+00   0.125      0.000)  //14
(0.000  56.1667   0.000    2.3130000E+00   0.125      0.000)  //15
(0.000  58.9000   0.000    2.0860000E+00   0.125      0.000)  //16
(0.000  61.6333   0.000    1.4190000E+00   0.125      0.000)  //17
(0.000  63.0000   0.000    1.4190000E+00   0.125      0.000)  //18
*/

